---
kind: property
id: P:Autodesk.Revit.DB.PDFExportOptions.OriginOffsetX
source: html/07ba4e7e-c834-a34b-9017-9d868f201524.htm
---
# Autodesk.Revit.DB.PDFExportOptions.OriginOffsetX Property

Offset between left sides of pdf content and paper. Always stored in unit of Feet.

## Syntax (C#)
```csharp
public double OriginOffsetX { get; set; }
```